import type { SidebarConfig } from "vuepress-theme-hope";

export const sidebar: SidebarConfig = {
  "/computer_principle/": [
    {
      text: "计算机系统原理",
      children: [
        {
          text: "第一章 计算机系统概述",
          children: [
            "01_计算机系统概述/01_1_冯诺依曼思想",
            "01_计算机系统概述/01_2_程序的开发和执行过程",
            "01_计算机系统概述/01_3_计算机系统层次结构",
            "01_计算机系统概述/01_4_计算机性能评价",
          ],
        },
        {
          text: "第二章 数据表示和运算",
          children: [
            "02_数据表示和运算/02_1_进位计数制",
            "02_数据表示和运算/02_2_定点数的编码规则",
            "02_数据表示和运算/02_3_浮点数与数值类型转换",
            "02_数据表示和运算/02_4_数据宽度与存放",
            "02_数据表示和运算/02_5_作业",
          ],
        },
        {
          text: "第三章 程序转换与机器级表示",
          link: "03_程序转换与机器级表示/03_程序转换与机器级表示",
          children: [
            "03_程序转换与机器级表示/03_1_程序转换",
            "03_程序转换与机器级表示/03_2_IA-32基础",
            "03_程序转换与机器级表示/03_3_常用指令",
            "03_程序转换与机器级表示/03_4_C语言程序的机器级表示",
            "03_程序转换与机器级表示/03_5_ATT格式",
            "03_程序转换与机器级表示/03_6_作业",
          ],
        },
        {
          text: "第四章 可执行文件的生成与加载",
          link: "04_可执行文件的生成与加载/04_可执行文件的生成与加载",
          children: [
            "04_可执行文件的生成与加载/04_1_可执行文件的生成与目标文件",
            "04_可执行文件的生成与加载/04_2_符号解析与重定位",
            "04_可执行文件的生成与加载/04_3_静态链接与动态链接",
            "04_可执行文件的生成与加载/04_4_程序加载与进程",
            "04_可执行文件的生成与加载/04_5_CPU执行指令与中断",
            "04_可执行文件的生成与加载/04_6_作业",
          ],
        },
        "05_程序的存储访问/05_程序的存储访问",
        "06_IO操作的实现/06_IO操作的实现",
      ],
    },
  ],
};
