import type { SidebarConfig } from "vuepress-theme-hope";

export const sidebar: SidebarConfig = {
  "/computer_principle/": [
    {
      text: "计算机系统原理",
      children: [
        {
          text: "第一章 计算机系统概述",
          children: [
            "01_计算机系统概述/01_1_冯诺依曼思想",
            "01_计算机系统概述/01_2_程序的开发和执行过程",
            "01_计算机系统概述/01_3_计算机系统层次结构",
            "01_计算机系统概述/01_4_计算机性能评价",
          ],
        },
        {
          text: "第二章 数据表示和运算",
          children: [
            "02_数据表示和运算/02_1_数值数据的表示",
            "02_数据表示和运算/02_2_非数值数据的表示",
            "02_数据表示和运算/02_3_数据的存放",
            "02_数据表示和运算/02_4_数据的运算",
          ],
        },
        "03_程序转换与机器级表示/03_程序转换与机器级表示",
        "04_可执行文件的生成与加载/04_可执行文件的生成与加载",
        "05_程序的存储访问/05_程序的存储访问",
        "06_IO操作的实现/06_IO操作的实现",
      ],
    },
  ],
};
